<template>
  <div class="home">


    <div class="block" >

<!--      走马灯-->
      <div class = "block1">
        <el-carousel trigger="click" height="300px" >
          <el-carousel-item v-for="item in imgdata" :key="item">
            <el-image :src="item"></el-image>
          </el-carousel-item>
        </el-carousel>
      </div>

      </div>

<!--    招生文案-->
      <div class = "block" >
        <el-divider></el-divider>
        <el-row gutter="15">
          <el-col :span="6" >
<!--            机构动态 左-->
            <div class="left">
<!--              机构动态栏上部分-->
              <el-row style="margin-bottom: 8px">
                <el-col :span="21">
                  <span class="block-left">
                    招生计划
                  </span></el-col>
                <el-col :span="3">
              <span class="block-right">
                更多>>
              </span>
                </el-col>
              </el-row>
              <div  >
                <ul>
                  <li class="textInItem"
                      v-for="item in zsjh"
                      :key="item">
                    {{item}}
                  </li>
                </ul>
              </div>
            </div>

<!--            左下-->
            <div class="left">
              <!--              机构动态栏上部分-->
              <el-row style="margin-bottom: 8px ">
                <el-col :span="21">
                  <span class="block-left">
                    机构动态
                  </span></el-col>
                <el-col :span="3">
              <span class="block-right">
                更多>>
              </span>
                </el-col>
              </el-row>
              <div  >
                <ul>
                  <li class="textInItem"
                      v-for="item in zswa"
                      :key="item">
                    {{item}}
                  </li>
                </ul>
              </div>
            </div>
          </el-col>
<!--          右-->
          <el-col :span="18">
            <div class="right">
              <el-row style="margin-bottom: 5px">
                <el-col :span="24">
                  <span class="block-left">
                    招生简章
                  </span></el-col>

              </el-row>
              <p style="word-wrap: break-word ;font-size: 12px;color: #4d5664;margin-left: 10px;margin-right: 10px;margin-top: 10px;text-align: left;text-indent: 2em" v-html="zsjz">
              </p>
            </div>

          </el-col>
        </el-row>
      </div>
    </div>


</template>

<script>

export default {
  data() {
    return {
      zswa: ['本田预计2025年推无人驾驶汽车 比其他公司晚5年',
      '针对日本市场推出Link移动 VR 头盔:U11专属',
      '普及太快！我们该不该对机器人征税呢',
      '解放人类的双手 机器人尝试自主学习抓取物体'],
      zsjz:'   广州城市理工学院（原华南理工大学广州学院）是经教育部批准设立的一所以工科为主，经济、管理、文学、理学、艺术协调发展的多科性应用型学校。2006年由广州云峰企业、华南理工大学合作创办，2021年经教育部批准转设为广州城市理工学院，系独立设置的本科层次民办普通高等学校。<br>' +
          '\n' +
          '学校位于粤港澳大湾区的核心城市广州，占地面积1753亩，建有14个实验中心，包括5个基础实验中心和9个专业实验中心，271个实验室，555个就业与实习基地。学校现有省级协同育人平台1个，省级实验教学示范中心7个，国家级大学生校外实践基地1个，省级大学生校外实践基地8个，国家级众创空间2个。<br>' +
          '\n' +
          '学校以习近平新时代中国特色社会主义思想为指导，坚持全面贯彻党的教育方针，立德树人。坚持“人才强校”战略，重视党建引领校园文化建设，通过“以老带新”、“双百工程”、组建学科团队等措施，提升师资队伍水平，现已形成了一支以学校自有教师为主、以兼职教师为辅的高素质教师队伍。其中，教育部长江学者特聘教授1人、全国优秀教师1人、全国优秀教育工作者1人、全国先进工作者1人、全国高校先进科技工作者1人、全国模范教师1人、享受国务院特殊津贴6人、广东省教学名师4人、广东省师德先进个人1人、广东省民办高校优秀教师4人、南粤优秀教师5人、南粤优秀教育工作者1人。2018年，我校教师获得我国建筑教育工作者最高荣誉奖——中国建筑设计奖·建筑教育奖。2014年和2018年，我校教师获省级教学成果奖二等奖各1次，2020年，我校教师获得省级教学成果奖一等奖1次。<br>' +
          '\n' +
          '学校瞄准区域产业发展和新工科建设，积极推进学科链、专业链与产业链对接，不断调整和优化学科专业布局。现有汽车与交通工程学院、机械工程学院、机器人工程学院、电子信息工程学院、通信工程学院、电气工程学院、计算机工程学院、大数据学院、管理学院、经济学院、外国语学院、珠宝学院、建筑学院、土木工程学院、国际商学院、马克思主义学院等16个学院，设置了机械工程、车辆工程、机器人工程、通信工程、计算机科学与技术、会计学、宝石及材料工艺学、新能源科学与技术、新能源汽车工程、智能建造等43个专业。学校现有省级重点建设学科2个，省一流专业建设点6个，省级质量工程特色专业11个，省级应用型人才培养示范专业3个，省级专业综合改革试点项目3个，省级立项科研平台3个，其中，广东省普通高校工程技术中心2个，人文社科重点研究基地1个。<br>' +
          '\n' +
          '学校始终把人才培养质量作为立校之本，着力培养高素质应用型创新人才，是广东省大学生创新创业教育示范学校。学生在各类创新创业实践基地、大学生创业园区、社团组织等特色鲜明的教育实践平台得到充分锻炼，并在各类学术科技竞赛及创新创业竞赛中屡创佳绩。2018年至今，学生在各类创新创业竞赛中共获得国际性赛事奖项105项、国家级424项、省级941项。其中，获第十六届“挑战杯”全国大学生课外学术科技作品竞赛二等奖 1 项，《低碳节能护栏喷涂小车》国家级大创项目受邀在第十三届全国大学生创新创业年会上展示并获“我最喜爱的项目”，是广东省入选全国大创年会唯一的民办院校。2021年学校顺利通过双创教育示范校复评，再次获评广东省大学生创新创业教育示范学校（2021-2024年）。<br>' +
          '\n' +
          '学校立足科技创新与产业化平台建设，重视应用研究与成果转化。先后成立了工程研究院、智能制造产业学院，搭建科研创新平台以及成果转化和产业技术服务平台，取得了一大批高质量的科研成果。五年来，学校获批各类科研项目477项，其中纵向项目79项，实到科研项目经费合计4061万元，发表论文1484篇，其中统计源以上论文639篇，申请专利1108件，其中PCT国际专利24件，发明专利390件，授权专利826件，其中发明专利86件，专利申请量、授权量稳居广东省民办本科院校前列。2017年学校获批成为广州市知识产权试点学校，2022年获批国家自然科学基金依托单位、省博士工作站。2018年，学校与华南理工大学启动硕士研究生联合培养工作，已招收学生共62人。<br>' +
          '\n' +
          '学校不断创新办学模式，先后组建协同育人平台和协同中心，与企业协同育人。2018年，学校与教育部学校规划建设发展中心、中科曙光共建“大数据学院”和“大数据应用创新中心”，校、企、政三方协同育人，共同培养大数据产业人才。2019年，我校智能制造产业学院获评广东省首批示范性产业学院，2020年珠宝学院获批广东省产业学院立项建设。<br>' +
          '\n' +
          '学校围绕“一带一路”倡议与粤港澳大湾区对国际化人才的需求，推进教育国际化发展战略。先后与英国、加拿大、法国等教育发达国家和台湾地区的高水平大学和机构建立合作关系，开展多元化合作。学校积极推进专业国际认证工作，已获得IACBE国际商科认证与IEET工科认证，是中国第一所获IACBE认证的大学、IACBE亚洲区副主席单位。<br>' +
          '\n' +
          '18年来，学校累计为社会输送各类人才5.2万人，毕业生平均就业率和就业质量稳居全国同类高校前列。学校先后获得“中国最具就业竞争力院校”“全国学生最信赖的十佳独立学院”“全国最具品牌影响力独立学院”等殊荣。在校友会网发布的2022年中国大学排名中，学校位居中国民办大学理工类第七位，是六星级中国顶尖民办大学。<br>' +
          '\n' +
          '站在新时代新起点上，学校以党的二十大精神和习近平新时代中国特色社会主义思想为旗帜，坚持诚信办学、规范办学，坚持改革创新、求真务实，坚持质量立校、特色兴校、人才强校，与区域经济和社会发展同行，建设具有省内一流、国内知名的应用型大学。<br>' +
          '\n' +
          '（统计日期截至2022年12月31日）',
      imgdata:['https://hq.gcu.edu.cn/_upload/article/images/17/8f/f0b4134140e28183362d7bd51d17/f0c8d75b-169d-4cc0-95fb-49f93d34dbf3.jpg'
      ,'https://hq.gcu.edu.cn/_upload/article/images/07/b4/6849638942bb81c87597980d7651/00d63dd3-8914-4256-939c-d8ac772e32ed.jpg'],
    }
  }
}
</script>
<style>


</style>
